<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.1 
# *Data Wrangling and Munging with Pandas*

## Part 1: Wrangling Data

The term "data wrangling" is analogous to capturing wild horses and getting them into a fenced area; the horses are data and the fencing is your computer. The more common data wrangling tasks include:

- reading flat files
- reading Excel files
- downloading from web pages
  - csv
  - html
  - json

In [ ]:
import numpy as np
import pandas as pd

*It is good practice to display the library version numbers for future reference:*

In [ ]:
print('Numpy: ', np.__version__)
print('Pandas: ', pd.__version__)

Numpy:  1.16.4
Pandas:  0.24.2

### CSV Files

Below are three attempts to load the file "bikeshare.csv" into a DataFrame named `bikes`. Why are they wrong?

In [ ]:
# wrong:
bikes = pd.read_table('../../../DATA/bikeshare.csv', header = None)
print(bikes.head())
print()

                                                   0
0  instant,dteday,season,yr,mnth,hr,holiday,weekd...
1  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
2  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
3  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
4  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...

C:\Users\ck_ra\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

In [ ]:
# wrong:
bikes = pd.read_table('../../../DATA/bikeshare.csv', header = None)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('../../../DATA/bikeshare.csv', header = 1)
print(bikes.head())
print()

# wrong:
bikes = pd.read_table('../../../DATA/bikeshare.csv', header = 0)
print(bikes.head())

                                                   0
0  instant,dteday,season,yr,mnth,hr,holiday,weekd...
1  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
2  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
3  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
4  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...

  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0,3,13,16
0  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
1  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
2  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...
3  5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,...
4  6,2011-01-01,1,0,1,5,0,6,0,2,0.24,0.2576,0.75,...

  instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0  1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,...
1  2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.8,0...
2  3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.8,0...
3  4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,...
4  5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,...

C:\Users\ck_ra\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

C:\Users\ck_ra\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  import sys
C:\Users\ck_ra\Anaconda3\lib\site-packages\ipykernel_launcher.py:12: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  if sys.path[0] == '':

?:

> Indented block


ANSWER: Case 1 treats headings as just another data row. Case 2 treats the 1st data row as the column header. Case 3 gets the header right (row 0), but reads each row as a single column (Nb. the other two make that same mistake).

Load the file "bikeshare.csv" into a DataFrame named `bikes`, and confirm that it was loaded properly:

In [ ]:
#ANSWER:
bikes = pd.read_table('../../../DATA/bikeshare.csv', header = 0, sep = ',')
print(bikes.head())

   instant      dteday  season  yr  mnth  hr  holiday  weekday  workingday  \
0        1  2011-01-01       1   0     1   0        0        6           0
1        2  2011-01-01       1   0     1   1        0        6           0
2        3  2011-01-01       1   0     1   2        0        6           0
3        4  2011-01-01       1   0     1   3        0        6           0
4        5  2011-01-01       1   0     1   4        0        6           0

   weathersit  temp   atemp   hum  windspeed  casual  registered  cnt
0           1  0.24  0.2879  0.81        0.0       3          13   16
1           1  0.22  0.2727  0.80        0.0       8          32   40
2           1  0.22  0.2727  0.80        0.0       5          27   32
3           1  0.24  0.2879  0.75        0.0       3          10   13
4           1  0.24  0.2879  0.75        0.0       0           1    1

C:\Users\ck_ra\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

Note that we could have used `read.csv()` above. When is `read_table()` necessary?

?:
ANSWER: When `sep` is not the comma character, or we need fine control that `read.csv()` does not provide.

Flat files can be full of surprises. Here are some issues to watch out for:

- separator character is something other than the comma
  - ";", "|", and tab are popular
- newline character is something other than what the O/S expects 
  - Tip: Don't hard-code the character codes for carriage returns, linefeeds, etc. Use Python's built-in representation instead (e.g. Python translates "\n" to the newline character and "\t" to the tab character on any O/S).
- truncated lines
  - if there are empty fields at the end of a line it is possible that their separators will be missing, resulting in a "jagged" file
- embedded commas or quotes
  - a free-text field containing embedded commas may split into separate fields on input
  - a free-text field containing embedded quotes may not parse correctly
- unescaped characters
  - the "\" character indicates a control code to Python, which will break the I/O
    - e.g. the substring "\u0123" will be interpreted as Unicode(0123) -- which may not be what the file creator intended
  - these may need to be fixed by loading whole strings and then parsing into a new data frame
  
Tip: Most issues can be delth with by correctly specifying the parameters of the function you use to load the file. Read the doco before reading the data!

### Reading Excel Files

In [ ]:
from pandas import ExcelFile  # Nb. Need to install xlrd from conda (it does not automatically install with pandas)

In [ ]:
df = pd.read_excel('../../../DATA/Iris.xls', sheet_name = 'Data')
df

,Species_No,Petal_width,Petal_length,Sepal_width,Sepal_length,Species_name
0,1,0.2,1.4,3.5,5.1,Setosa
1,1,0.2,1.4,3.0,4.9,Setosa
2,1,0.2,1.3,3.2,4.7,Setosa
3,1,0.2,1.5,3.1,4.6,Setosa
4,1,0.2,1.4,3.6,5.0,Setosa
5,1,0.4,1.7,3.9,5.4,Setosa
6,1,0.3,1.4,3.4,4.6,Setosa
7,1,0.2,1.5,3.4,5.0,Setosa
8,1,0.2,1.4,2.9,4.4,Setosa
9,1,0.1,1.5,3.1,4.9,Setosa
10,1,0.2,1.5,3.7,5.4,Setosa
11,1,0.2,1.6,3.4,4.8,Setosa
12,1,0.1,1.4,3.0,4.8,Setosa
13,1,0.1,1.1,3.0,4.3,Setosa
14,1,0.2,1.2,4.0,5.8,Setosa
15,1,0.4,1.5,4.4,5.7,Setosa
16,1,0.4,1.3,3.9,5.4,Setosa
17,1,0.3,1.4,3.5,5.1,Setosa
18,1,0.3,1.7,3.8,5.7,Setosa
19,1,0.3,1.5,3.8,5.1,Setosa
20,1,0.2,1.7,3.4,5.4,Setosa
21,1,0.4,1.5,3.7,5.1,Setosa
22,1,0.2,1.0,3.6,4.6,Setosa
23,1,0.5,1.7,3.3,5.1,Setosa
24,1,0.2,1.9,3.4,4.8,Setosa
25,1,0.2,1.6,3.0,5.0,Setosa
26,1,0.4,1.6,3.4,5.0,Setosa
27,1,0.2,1.5,3.5,5.2,Setosa
28,1,0.2,1.4,3.4,5.2,Setosa
29,1,0.2,1.6,3.2,4.7,Setosa
...,...,...,...,...,...,...
120,3,2.3,5.7,3.2,6.9,Verginica
121,3,2.0,4.9,2.8,5.6,Verginica
122,3,2.0,6.7,2.8,7.7,Verginica
123,3,1.8,4.9,2.7,6.3,Verginica
124,3,2.1,5.7,3.3,6.7,Verginica
125,3,1.8,6.0,3.2,7.2,Verginica
126,3,1.8,4.8,2.8,6.2,Verginica
127,3,1.8,4.9,3.0,6.1,Verginica
128,3,2.1,5.6,2.8,6.4,Verginica
129,3,1.6,5.8,3.0,7.2,Verginica
130,3,1.9,6.1,2.8,7.4,Verginica
131,3,2.0,6.4,3.8,7.9,Verginica
132,3,2.2,5.6,2.8,6.4,Verginica
133,3,1.5,5.1,2.8,6.3,Verginica
134,3,1.4,5.6,2.6,6.1,Verginica
135,3,2.3,6.1,3.0,7.7,Verginica
136,3,2.4,5.6,3.4,6.3,Verginica
137,3,1.8,5.5,3.1,6.4,Verginica
138,3,1.8,4.8,3.0,6.0,Verginica
139,3,2.1,5.4,3.1,6.9,Verginica
140,3,2.4,5.6,3.1,6.7,Verginica
141,3,2.3,5.1,3.1,6.9,Verginica
142,3,1.9,5.1,2.7,5.8,Verginica
143,3,2.3,5.9,3.2,6.8,Verginica
144,3,2.5,5.7,3.3,6.7,Verginica
145,3,2.3,5.2,3.0,6.7,Verginica
146,3,1.9,5.0,2.5,6.3,Verginica
147,3,2.0,5.2,3.0,6.5,Verginica
148,3,2.3,5.4,3.4,6.2,Verginica
149,3,1.8,5.1,3.0,5.9,Verginica

So, this file appears to have an embedded table of aggregates on the same sheet as the raw data (a naughty but common practice amongst analysts).

It is usually better to load data correctly than to meddle with the source file or load it 'warts and all' and then try to parse it in code. The Pandas functions for reading files have parameters that provide the control we need. For ecxample, we could make multiple calls to `read_excel()`, using combinations of the `header`, `usecols`, `skiprows`, `nrows`, and `skipfooter` parameters to load one table at a time from a spreadsheet with multiple tables.

Load the above file without the unwanted columns:

In [ ]:
#ANSWER
df = pd.read_excel('../../../DATA/Iris.xls', sheet_name = 'Data', header = 0, usecols = [0, 1, 2, 3, 4])
df

     Species_No  Petal_width  Petal_length  Sepal_width  Sepal_length
0             1          0.2           1.4          3.5           5.1
1             1          0.2           1.4          3.0           4.9
2             1          0.2           1.3          3.2           4.7
3             1          0.2           1.5          3.1           4.6
4             1          0.2           1.4          3.6           5.0
5             1          0.4           1.7          3.9           5.4
6             1          0.3           1.4          3.4           4.6
7             1          0.2           1.5          3.4           5.0
8             1          0.2           1.4          2.9           4.4
9             1          0.1           1.5          3.1           4.9
10            1          0.2           1.5          3.7           5.4
11            1          0.2           1.6          3.4           4.8
12            1          0.1           1.4          3.0           4.8
13            1          0.1           1.1          3.0           4.3
14            1          0.2           1.2          4.0           5.8
15            1          0.4           1.5          4.4           5.7
16            1          0.4           1.3          3.9           5.4
17            1          0.3           1.4          3.5           5.1
18            1          0.3           1.7          3.8           5.7
19            1          0.3           1.5          3.8           5.1
20            1          0.2           1.7          3.4           5.4
21            1          0.4           1.5          3.7           5.1
22            1          0.2           1.0          3.6           4.6
23            1          0.5           1.7          3.3           5.1
24            1          0.2           1.9          3.4           4.8
25            1          0.2           1.6          3.0           5.0
26            1          0.4           1.6          3.4           5.0
27            1          0.2           1.5          3.5           5.2
28            1          0.2           1.4          3.4           5.2
29            1          0.2           1.6          3.2           4.7
..          ...          ...           ...          ...           ...
120           3          2.3           5.7          3.2           6.9
121           3          2.0           4.9          2.8           5.6
122           3          2.0           6.7          2.8           7.7
123           3          1.8           4.9          2.7           6.3
124           3          2.1           5.7          3.3           6.7
125           3          1.8           6.0          3.2           7.2
126           3          1.8           4.8          2.8           6.2
127           3          1.8           4.9          3.0           6.1
128           3          2.1           5.6          2.8           6.4
129           3          1.6           5.8          3.0           7.2
130           3          1.9           6.1          2.8           7.4
131           3          2.0           6.4          3.8           7.9
132           3          2.2           5.6          2.8           6.4
133           3          1.5           5.1          2.8           6.3
134           3          1.4           5.6          2.6           6.1
135           3          2.3           6.1          3.0           7.7
136           3          2.4           5.6          3.4           6.3
137           3          1.8           5.5          3.1           6.4
138           3          1.8           4.8          3.0           6.0
139           3          2.1           5.4          3.1           6.9
140           3          2.4           5.6          3.1           6.7
141           3          2.3           5.1          3.1           6.9
142           3          1.9           5.1          2.7           5.8
143           3          2.3           5.9          3.2           6.8
144           3          2.5           5.7          3.3           6.7
145           3          2.3           5.2          3.0           6.7
146           3          1.9           5.0          2.5           6.3
147           3          2.0           5.2          3.0           6.5
148           3          2.3           5.4          3.4           6.2
149           3          1.8           5.1          3.0           5.9

[150 rows x 5 columns]

### Importing Data Directly from the Web

We usually want to store a local copy of a data file that we download from the Web, but when data retention is not a priority it is convenient to download the data directly into our running Python environment.

#### Importing Text Files from the Web

The web is the 'wild west' of data formats. However, we can usually expect good behaviour from files that are automatically generated by a service, such as the earthquake report:

In [ ]:
df = pd.read_csv('https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/2.5_hour.csv')
df.head()

,time,latitude,longitude,depth,mag,magType,nst,gap,dmin,rms,...,updated,place,type,horizontalError,depthError,magError,magNst,status,locationSource,magSource
0,2020-03-29T20:45:26.309Z,17.008900,-66.475600,10,2.80,ml,NaN,326.000000,0.981000,0.820000,...,2020-03-29T20:58:21.040Z,"106km S of Santa Isabel, Puerto Rico",earthquake,8.200000,2.0,0.076,23,reviewed,us,us
1,2020-03-29T20:34:36.927Z,35.096333,-95.274689,5,2.64,ml,28.0,204.205658,0.191161,0.616913,...,2020-03-29T20:38:15.180Z,"9km ESE of Quinton, Oklahoma",earthquake,4.065633,NaN,NaN,22,automatic,ok,ok
2,2020-03-29T20:26:00.328Z,13.628600,-91.370100,10,4.60,mb,NaN,196.000000,0.944000,1.160000,...,2020-03-29T20:59:14.995Z,"61km SW of La Gomera, Guatemala",earthquake,7.600000,2.0,0.051,113,reviewed,us,us

#### Importing HTML Files from the Web

Working with unstructured HTML files relies heavily on library functions. This one, however, is well-structured:

In [ ]:
url = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
df = pd.read_html(url)
df

[                                             Bank Name                City  \
 0                                   Ericson State Bank             Ericson
 1                     City National Bank of New Jersey              Newark
 2                                        Resolute Bank              Maumee
 3                                Louisa Community Bank              Louisa
 4                                 The Enloe State Bank              Cooper
 5                  Washington Federal Bank for Savings             Chicago
 6      The Farmers and Merchants State Bank of Argonia             Argonia
 7                                  Fayette County Bank          Saint Elmo
 8    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 9                                       First NBC Bank         New Orleans
 10                                       Proficio Bank  Cottonwood Heights
 11                       Seaway Bank and Trust Company             Chicago
 12                              Harvest Community Bank          Pennsville
 13                                         Allied Bank            Mulberry
 14                        The Woodbury Banking Company            Woodbury
 15                              First CornerStone Bank     King of Prussia
 16                                  Trust Company Bank             Memphis
 17                          North Milwaukee State Bank           Milwaukee
 18                              Hometown National Bank            Longview
 19                                 The Bank of Georgia      Peachtree City
 20                                        Premier Bank              Denver
 21                                      Edgebrook Bank             Chicago
 22                              Doral Bank  En EspaÃ±ol            San Juan
 23                   Capitol City Bank & Trust Company             Atlanta
 24                             Highland Community Bank             Chicago
 25                    First National Bank of Crestview           Crestview
 26                                  Northern Star Bank             Mankato
 27              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 28               The National Republic Bank of Chicago             Chicago
 29                                      NBRS Financial          Rising Sun
 ..                                                 ...                 ...
 530                                  ANB Financial, NA         Bentonville
 531                                          Hume Bank                Hume
 532                             Douglass National Bank         Kansas City
 533                                  Miami Valley Bank            Lakeview
 534                                            NetBank          Alpharetta
 535                          Metropolitan Savings Bank          Pittsburgh
 536                                    Bank of Ephraim             Ephraim
 537                                      Reliance Bank        White Plains
 538              Guaranty National Bank of Tallahassee         Tallahassee
 539                                Dollar Savings Bank              Newark
 540                               Pulaski Savings Bank        Philadelphia
 541              First National Bank of Blanchardville      Blanchardville
 542                              Southern Pacific Bank            Torrance
 543                        Farmers Bank of Cheneyville         Cheneyville
 544                                      Bank of Alamo               Alamo
 545             AmTrade International Bank  En EspaÃ±ol             Atlanta
 546                     Universal Federal Savings Bank             Chicago
 547                       Connecticut Bank of Commerce            Stamford
 548                                   New Century Bank     Shelby Township
 549                              Net 1st National Bank          Boca Raton
 550                                       NextBank, NA             Phoenix
 551                           Oakwood Deposit Bank Co.             Oakwood
 552                              Bank of Sierra Blanca       Sierra Blanca
 553                      Hamilton Bank, NA  En EspaÃ±ol               Miami
 554                             Sinclair National Bank            Gravette
 555                                 Superior Bank, FSB            Hinsdale
 556                                Malta National Bank               Malta
 557                    First Alliance Bank & Trust Co.          Manchester
 558                  National State Bank of Metropolis          Metropolis
 559                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date
 0    NE  18265           Farmers and Merchants Bank   February 14, 2020
 1    NJ  21111                      Industrial Bank    November 1, 2019
 2    OH  58317                   Buckeye State Bank    October 25, 2019
 3    KY  58112    Kentucky Farmers Bank Corporation    October 25, 2019
 4    TX  10716                   Legend Bank, N. A.        May 31, 2019
 5    IL  30570                   Royal Savings Bank   December 15, 2017
 6    KS  17719                          Conway Bank    October 13, 2017
 7    IL   1802            United Fidelity Bank, fsb        May 26, 2017
 8    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 9    LA  58302                         Whitney Bank      April 28, 2017
 10   UT  35495                    Cache Valley Bank       March 3, 2017
 11   IL  19328                  State Bank of Texas    January 27, 2017
 12   NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 13   AR     91                         Today's Bank  September 23, 2016
 14   GA  11297                          United Bank     August 19, 2016
 15   PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 16   TN   9956           The Bank of Fayette County      April 29, 2016
 17   WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 18   WA  35156                       Twin City Bank     October 2, 2015
 19   GA  35259                        Fidelity Bank     October 2, 2015
 20   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 21   IL  57772             Republic Bank of Chicago         May 8, 2015
 22   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 23   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 24   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 25   FL  17557                       First NBC Bank    January 16, 2015
 26   MN  34983                            BankVista   December 19, 2014
 27   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 28   IL    916                  State Bank of Texas    October 24, 2014
 29   MD   4862                          Howard Bank    October 17, 2014
 ..   ..    ...                                  ...                 ...
 530  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 531  MO   1971                        Security Bank       March 7, 2008
 532  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 533  OH  16848         The Citizens Banking Company     October 4, 2007
 534  GA  32575                           ING DIRECT  September 28, 2007
 535  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 536  UT   1249                        Far West Bank       June 25, 2004
 537  NY  26778                     Union State Bank      March 19, 2004
 538  FL  26838              Hancock Bank of Florida      March 12, 2004
 539  NJ  31330                          No Acquirer   February 14, 2004
 540  PA  27203                       Earthstar Bank   November 14, 2003
 541  WI  11639                        The Park Bank         May 9, 2003
 542  CA  27094                            Beal Bank    February 7, 2003
 543  LA  16445            Sabine State Bank & Trust   December 17, 2002
 544  TN   9961                          No Acquirer    November 8, 2002
 545  GA  33784                          No Acquirer  September 30, 2002
 546  IL  29355               Chicago Community Bank       June 27, 2002
 547  CT  19183                   Hudson United Bank       June 26, 2002
 548  MI  34979                          No Acquirer      March 28, 2002
 549  FL  26652                       Bank Leumi USA       March 1, 2002
 550  AZ  22314                          No Acquirer    February 7, 2002
 551  OH   8966       The State Bank & Trust Company    February 1, 2002
 552  TX  22002     The Security State Bank of Pecos    January 18, 2002
 553  FL  24382     Israel Discount Bank of New York    January 11, 2002
 554  AR  34248                   Delta Trust & Bank   September 7, 2001
 555  IL  32646                Superior Federal, FSB       July 27, 2001
 556  OH   6629                    North Valley Bank         May 3, 2001
 557  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 558  IL   3815              Banterra Bank of Marion   December 14, 2000
 559  HI  21029                   Bank of the Orient    October 13, 2000

 [560 rows x 6 columns]]

In [ ]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
5,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
6,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017"
7,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017"
8,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017"
9,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017"
10,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017"
11,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017"
12,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017"
13,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016"
14,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016"
15,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016"
16,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016"
17,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016"
18,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015"
19,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015"
20,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015"
21,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015"
22,Doral Bank En EspaÃ±ol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015"
23,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015"
24,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015"
25,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015"
26,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014"
27,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014"
28,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014"
29,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014"
...,...,...,...,...,...,...
530,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008"
531,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008"
532,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008"
533,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007"
534,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007"
535,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007"
536,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004"
537,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004"
538,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004"
539,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004"
540,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003"
541,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003"
542,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003"
543,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002"
544,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002"
545,AmTrade International Bank En EspaÃ±ol,Atlanta,GA,33784,No Acquirer,"September 30, 2002"
546,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002"
547,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002"
548,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002"
549,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002"
550,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002"
551,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002"
552,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002"
553,"Hamilton Bank, NA En EspaÃ±ol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002"
554,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001"
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

#### Importing XML Files from the Web

XML files are semi-structured, but you're at the mercy of the file creator. If every record has the same format it will be much easier, but practical applications often require a lot of custom code. Here is an example that includes a nice parser class: http://www.austintaylor.io/lxml/python/pandas/xml/dataframe/2016/07/08/convert-xml-to-pandas-dataframe/

#### Importing JSON Files from the Web

Like XML, JSON files are semi-structured and may require work to capture the schema into a dataframe. Here is a simple example:

In [ ]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
df = pd.read_json(url, orient = 'columns')
df.head()

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0

## Part 2: Data Munging

Data munging is manipulating data to get it into a form that we can start running analyses on (which usually means getting the data into a DataFrame). Before we get to this stage, we may need to remove headers or footers, transpose columns to rows, split wide data tables into long ones, and so on. (Nb. Excel files can be particularly troublesome, because users can format their data in mixed, complex shapes.) Essentially, we need to follow Hadley Wickham's guidelines for tidy datasets (http://vita.had.co.nz/papers/tidy-data.html):

The end goal of the cleaning data process:

- each variable should be in one column
- each observation should comprise one row
- each type of observational unit should form one table
- include key columns for linking multiple tables
- the top row contains (sensible) variable names
- in general, save data as one file per table

### Dataset Morphology

Once we have our dataset in a DataFrame (or Series, if our data is only 1-dimensional), we can start examining its size and content.

How many rows and columns are in `bikes`?

In [ ]:
#ANSWER
bikes.shape

(17379, 17)

What are the column names in `bikes`?

In [ ]:
#ANSWER
bikes.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

What are the data types of these columns?

In [ ]:
#ANSWER
bikes.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

What is the (row) index for this DataFrame?

---

In [ ]:
#ANSWER
bikes.index

RangeIndex(start=0, stop=17379, step=1)

https://www.dataquest.io/blog/python-json-tutorial/

## Slicing and Dicing

It is often preferable to refer to DataFrame columns by name, but there is more than one way to do this. 
Do `bikes['season']` and `bikes[['season']]` give the same object? Demonstrate:

In [ ]:
#ANSWER
print(bikes['atemp'].head())
print(type(bikes['atemp']))
print(bikes[['atemp']].head())
print(type(bikes[['atemp']]))

0    0.2879
1    0.2727
2    0.2727
3    0.2879
4    0.2879
Name: atemp, dtype: float64
<class 'pandas.core.series.Series'>
    atemp
0  0.2879
1  0.2727
2  0.2727
3  0.2879
4  0.2879
<class 'pandas.core.frame.DataFrame'>

How would we use object notation to show the first 4 rows of `atemp`?

In [ ]:
#ANSWER
print(bikes.atemp[:4])

0    0.2879
1    0.2727
2    0.2727
3    0.2879
Name: atemp, dtype: float64

Algorithms that loop over multiple columns often access DataFrame columns by index. However, none of the following work (try them out by uncommenting / removing the "#E: " ):

In [ ]:
bikes[[0]]
#E: bikes[0]
#E: bikes[0,0]
#E: bikes[[0,0]]

KeyError: "None of [Int64Index([0], dtype='int64')] are in the [columns]"

What is the correct way to access the 1st row of the DataFrame by its index?

In [ ]:
#ANSWER
bikes[:1]

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16

What is the correct way to access the 2nd column of the DataFrame by its index?

In [ ]:
#ANSWER
bikes.iloc[:, 1]

0        2011-01-01
1        2011-01-01
2        2011-01-01
3        2011-01-01
4        2011-01-01
5        2011-01-01
6        2011-01-01
7        2011-01-01
8        2011-01-01
9        2011-01-01
10       2011-01-01
11       2011-01-01
12       2011-01-01
13       2011-01-01
14       2011-01-01
15       2011-01-01
16       2011-01-01
17       2011-01-01
18       2011-01-01
19       2011-01-01
20       2011-01-01
21       2011-01-01
22       2011-01-01
23       2011-01-01
24       2011-01-02
25       2011-01-02
26       2011-01-02
27       2011-01-02
28       2011-01-02
29       2011-01-02
            ...
17349    2012-12-30
17350    2012-12-30
17351    2012-12-30
17352    2012-12-30
17353    2012-12-30
17354    2012-12-30
17355    2012-12-31
17356    2012-12-31
17357    2012-12-31
17358    2012-12-31
17359    2012-12-31
17360    2012-12-31
17361    2012-12-31
17362    2012-12-31
17363    2012-12-31
17364    2012-12-31
17365    2012-12-31
17366    2012-12-31
17367    2012-12-31
17368    2012-12-31
17369    2012-12-31
17370    2012-12-31
17371    2012-12-31
17372    2012-12-31
17373    2012-12-31
17374    2012-12-31
17375    2012-12-31
17376    2012-12-31
17377    2012-12-31
17378    2012-12-31
Name: dteday, Length: 17379, dtype: object

?..............................

## Handling Missing Values

What is the Pandas `isnull` function for?

?
ANSWER: Detecting missing values.

We can apply `isnull` to the `bikes` DataFrame to show the result for every element:

In [ ]:
bikes.isnull().head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

However, we usually start at a higher level. How many nulls are in `bikes` altogether?

In [ ]:
#ANSWER
bikes['windspeed'].isnull().sum()

0

If this result were nonzero we would next want to find out which columns contained nulls. How can this be done in one line of code?

In [ ]:
#ANSWER
bikes.isnull().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

What is the Numpy object `nan` used for? (Write a descriptive answer.)

?
ANSWER: Marking a data point as invalid.

Write (and verify) a function that performs scalar division with built-in handling of the edge case (i.e. return a value instead of just trapping the error):

In [ ]:
#ANSWER
def divide(dividend, divisor):
    if divisor == 0:
        quotient = np.nan
    else:
        quotient = dividend / divisor
    return (quotient)

print(divide(1, 0))

nan

Apply the Pandas `isna` function to the following data objects:

In [ ]:
x = 2.3
y = np.nan
print(x, y)

2.3 nan

In [ ]:
#ANSWER
print(pd.isna(x), pd.isna(y))

False True

In [ ]:
array = np.array([[1, np.nan, 3], [4, 5, np.nan]])
print(array)

[[ 1. nan  3.]
 [ 4.  5. nan]]

In [ ]:
#ANSWER
print(pd.isna(array))

[[False  True False]
 [False False  True]]

How is the pandas I/O parameter `na_values` used?

? ANSWER: For converting specially coded strings to NaN on input (e.g. "###", "N/A", "NULL").

## Data Profiling

### Counts

When there are categorical variables in a dataset we will want to know how many possible values there are in each column. (Nb. If the dataset is a sample of a larger one, our sample may not capture all possible values of every categorical.)

How many (different) seasons are in `bikes`?

In [ ]:
#ANSWER
bikes['season'].value_counts()

3    4496
2    4409
1    4242
4    4232
Name: season, dtype: int64

### Ranges

Print the range of the `instant`, `dteday`, and `windspeed` columns:

In [ ]:
#ANSWER
print('instant:', bikes['instant'].min(), 'to', bikes['instant'].max())
print('dteday:', bikes['dteday'].min(), 'to', bikes['dteday'].max())
print('windspeed:', bikes['windspeed'].min(), 'to', bikes['windspeed'].max())

instant: 1 to 17379
dteday: 2011-01-01 to 2012-12-31
windspeed: 0.0 to 0.8507

Compute and print the overall minimum and maximum of the numeric data columns:

In [ ]:
bikes_min, bikes_max = (min(bikes.min(numeric_only=True)), 
                        max(bikes.max(numeric_only=True)))
bikes_min, bikes_max

(0.0, 17379.0)

### Quantiles

Pandas makes computing quantiles easy. This is how to get the median of a Series:

In [ ]:
bikes['atemp'].quantile(0.5)

0.4848

Of course, the `quantiles` method can take a tuple as its argument. Compute the 10th, 25th, 50th, 75th, and 90th percentiles in one line of code:

In [ ]:
#ANSWER
bikes['atemp'].quantile((0.1, 0.25, 0.5, 0.75, 0.9))

0.10    0.2424
0.25    0.3333
0.50    0.4848
0.75    0.6212
0.90    0.6970
Name: atemp, dtype: float64

### Cuts

Sometimes we want to split the sample not by the quantiles of the distribution but by the range of the data. Let's take a closer look at `atemp`:

In [ ]:
type(bikes['atemp'])

pandas.core.series.Series

In [ ]:
bikes.sample(5)

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
5551,5552,2011-08-24,3,0,8,5,0,3,1,1,0.56,0.5303,0.73,0.1045,1,26,27
9443,9444,2012-02-03,1,1,2,9,0,5,1,1,0.24,0.2273,0.65,0.1940,18,252,270
15105,15106,2012-09-26,4,1,9,14,0,3,1,1,0.74,0.6667,0.48,0.2836,60,217,277
9446,9447,2012-02-03,1,1,2,12,0,5,1,1,0.34,0.3333,0.46,0.1343,25,191,216
9786,9787,2012-02-17,1,1,2,17,0,5,1,1,0.42,0.4242,0.32,0.3284,36,429,465

Suppose we decide to sort these values into 4 bins of equal width, but we want to apply the resulting groups to the entire DataFrame. Basically, we need to add a row label that indcates which bin each sample belongs in. Let's call this label "atemp_level", and use the `cut` method to populate it:

In [ ]:
atemp_level = pd.cut(bikes['atemp'], bins = 4)

What is `atemp_level`?

In [ ]:
#ANSWER
print(type(atemp_level))

<class 'pandas.core.series.Series'>

Here is a random sample of `atemp_level`:

In [ ]:
atemp_level.sample(5)

13956       (0.75, 1.0]
9077     (-0.001, 0.25]
15544       (0.5, 0.75]
10389       (0.5, 0.75]
1248        (0.25, 0.5]
Name: atemp, dtype: category
Categories (4, interval[float64]): [(-0.001, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

So, by default, `cut` produces labels that indicate the bin boundaries for each element in the series it was applied to. Usually, we will specify labels that are appropriate to the discretisation we are applying:

In [ ]:
atemp_level = pd.cut(bikes['atemp'], bins = 4, labels = ["cool", "mild", "warm", "hot"])
atemp_level.sample(5)

964      mild
1601     cool
8387     mild
12139    warm
6244     warm
Name: atemp, dtype: category
Categories (4, object): [cool < mild < warm < hot]

Incorporate the new `atemp_level` column into the `bikes` DataFrame and use it to count the number of "mild" `atemp` entries in `season` 2:

In [ ]:
#ANSWER
bikes['atemp_level'] = atemp_level
bikes[(bikes.atemp_level == 'mild') & (bikes.season == 2)].season.count()  # Nb. could have used any column before count() in this case

1829

*Nb. The `atemp_level` variable we created is what the R language calls a "factor". Pandas has introduced a new data type called "category" that is similar to R's factors.*

# Synthetic Data

Sometimes we may want to generate test data, or we may need to initalise a series, matrix, or data frame for input to an algorithm. Numpy has several methods we can use for this.

Execute the following, then check the shape and content of each variable:

In [ ]:
# Creating arrays with initial values
a = np.zeros((3))
b = np.ones((1,3))
c = np.random.randint(1,10,(2,3,4))   # randint(low, high, size)
d = np.arange(4)
e = np.array( [[1,2,3,4], [5,6,7,8]] )

In [ ]:
# Cleaning Data

## Load Data

Load rock.csv and clean the dataset.

In [ ]:
# Load CSV File
rock_csv = '../../../DATA/rock.csv'
rock = pd.read_csv(rock_csv)

## Check Column Names

Check column names and clean.

In [ ]:
# Check column names
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

Columns names are not uniform.

    Uppercase, Lowercase > Lowercase
    Space > _
    ?, * > Remove

In [ ]:
def clean_column_name(column_names):
    clean_column_names = []
    for c in column_names:
        c = c.lower().replace(' ', '_')
        c = c.lower().replace('*', '')
        c = c.lower().replace('?', '')
        clean_column_names.append(c)
        
    return clean_column_names

In [ ]:
rock.columns = clean_column_name(rock.columns)

# Replace Null Values With 0

Check 'release' column whether this column have any null value or not. Replace null value with 0.

In [ ]:
# Check is there any nul values in any column
rock.isnull().sum()

song_clean        0
artist_clean      0
release_year    577
combined          0
first             0
year              0
playcount         0
fg                0
dtype: int64

- release year got 577 null values.

In [ ]:
# Create a mask to find all rows with null values
null_mask = rock['release_year'].isnull()
rock.loc[null_mask, 'release_year'] = 0

In [ ]:
# Check is there any nul values in any column
rock.isnull().sum()

song_clean      0
artist_clean    0
release_year    0
combined        0
first           0
year            0
playcount       0
fg              0
dtype: int64

# Check Datatypes of Dataset

Check datatypes of the dataset. Is there any column which should be int instead of object? Fix the column.

In [ ]:
# Check datatypes
rock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2230 entries, 0 to 2229
Data columns (total 8 columns):
song_clean      2230 non-null object
artist_clean    2230 non-null object
release_year    2230 non-null object
combined        2230 non-null object
first           2230 non-null int64
year            2230 non-null int64
playcount       2230 non-null int64
fg              2230 non-null int64
dtypes: int64(4), object(4)
memory usage: 139.5+ KB

- release_year is object which should be integer

In [ ]:
# Chekc values of release_year

rock['release_year'].value_counts()

0                577
1973             104
1977              83
1975              83
1970              81
1971              75
1969              72
1980              70
1978              64
1979              63
1981              61
1967              61
1983              60
1976              56
1982              54
1984              51
1972              50
1974              48
1968              46
1987              39
1985              39
1986              37
1991              34
1989              32
1966              30
1988              29
1965              28
1994              25
1990              22
1993              19
1992              14
1964              14
1999              13
1995              10
1997               9
1963               9
1996               9
2002               6
1998               6
2005               5
2004               5
2012               5
2001               4
2007               3
2008               3
1962               3
2003               3
2000               3
2011               3
2014               2
2013               2
1961               1
1958               1
1955               1
1071               1
SONGFACTS.COM      1
2006               1
Name: release_year, dtype: int64

- SONGFACTS.COM is not a valid release_year

In [ ]:
# Create a mask to find all rows with SONGFACTS.COM
song_facts_mask = rock['release_year'] == 'SONGFACTS.COM'
rock.loc[song_facts_mask, 'release_year'] = np.NaN

In [ ]:
# Convert release year to numeric
rock['release_year'] = pd.to_numeric(rock['release_year'])

In [ ]:
# Check data types
rock.dtypes

song_clean       object
artist_clean     object
release_year    float64
combined         object
first             int64
year              int64
playcount         int64
fg                int64
dtype: object

# Check Min, Max of Each Column

*   List item
*   List item



Is there any illogical value in any column? How can we fix that?

In [ ]:
def check_min_max(df):
    # Check min, max of each column
    print(df.describe().T[['min', 'max']])

In [ ]:
check_min_max(rock)

              min     max
release_year  0.0  2014.0
first         1.0     1.0
year          0.0     1.0
playcount     0.0   142.0
fg            0.0   142.0

- Minimum Value of release year is 0, which is wrong

In [ ]:
# Create a mask to find all rows with 0
song_facts_mask = rock['release_year'] == 0
rock.loc[song_facts_mask, 'release_year'] = np.NaN

In [ ]:
check_min_max(rock)

                 min     max
release_year  1071.0  2014.0
first            1.0     1.0
year             0.0     1.0
playcount        0.0   142.0
fg               0.0   142.0

*italicized text*- Still minimum value is 1071. It's very unlikely there were any rock song in that year!

In [ ]:
# Create a mask to find all rows with 0
song_facts_mask = rock['release_year'] == 1071
rock.loc[song_facts_mask, 'release_year'] = np.NaN

In [ ]:
check_min_max(rock)

                 min     max
release_year  1955.0  2014.0
first            1.0     1.0
year             0.0     1.0
playcount        0.0   142.0
fg               0.0   142.0

# Write Some Functions

## Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970

In [ ]:
rock.dtypes

song_clean       object
artist_clean     object
release_year    float64
combined         object
first             int64
year              int64
playcount         int64
fg                int64
dtype: object

In [ ]:
def check_song(row):
    print('Song: ', row['song_clean'])
    print('Artist: ', row['artist_clean'])
    print('Released before 1970: ', row['release_year'] < 1970)
    print('\n')

In [ ]:
rock.iloc[0]

song_clean                     Caught Up in You
artist_clean                        .38 Special
release_year                               1982
combined        Caught Up in You by .38 Special
first                                         1
year                                          1
playcount                                    82
fg                                           82
Name: 0, dtype: object

In [ ]:
# Check any row using index
check_song(rock.iloc[0])

Song:  Caught Up in You
Artist:  .38 Special
Released before 1970:  False

In [ ]:
# Check first five rows
rock.head(5).apply(check_song, axis=1)

Song:  Caught Up in You
Artist:  .38 Special
Released before 1970:  False


Song:  Fantasy Girl
Artist:  .38 Special
Released before 1970:  False


Song:  Hold On Loosely
Artist:  .38 Special
Released before 1970:  False


Song:  Rockin' Into the Night
Artist:  .38 Special
Released before 1970:  False


Song:  Art For Arts Sake
Artist:  10cc
Released before 1970:  False

0    None
1    None
2    None
3    None
4    None
dtype: object

## Write a function that converts cells in a DataFrame to float and otherwise replaces them with np.nan

In [ ]:
def convert_to_float(column):
    column = pd.to_numeric(column, errors='coerce')
    return column

## Apply these functions to your dataset

In [ ]:
rock.apply(convert_to_float)

,song_clean,artist_clean,release_year,combined,first,year,playcount,fg
0,NaN,NaN,1982.0,NaN,1,1,82,82
1,NaN,NaN,NaN,NaN,1,0,3,0
2,NaN,NaN,1981.0,NaN,1,1,85,85
3,NaN,NaN,1980.0,NaN,1,1,18,18
4,NaN,NaN,1975.0,NaN,1,1,1,1
5,NaN,NaN,2000.0,NaN,1,1,13,13
6,NaN,NaN,2000.0,NaN,1,1,1,1
7,NaN,NaN,2002.0,NaN,1,1,6,6
8,NaN,NaN,1992.0,NaN,1,1,3,3
9,NaN,NaN,1985.0,NaN,1,1,1,1
10,NaN,NaN,NaN,NaN,1,0,1,0
11,NaN,NaN,1980.0,NaN,1,1,97,97
12,NaN,NaN,1993.0,NaN,1,1,6,6
13,NaN,NaN,NaN,NaN,1,0,5,0
14,NaN,NaN,1976.0,NaN,1,1,85,85
15,NaN,NaN,1981.0,NaN,1,1,46,46
16,NaN,NaN,NaN,NaN,1,0,24,0
17,NaN,NaN,1995.0,NaN,1,1,1,1
18,NaN,NaN,1980.0,NaN,1,1,39,39
19,NaN,NaN,1980.0,NaN,1,1,74,74
20,NaN,NaN,1979.0,NaN,1,1,92,92
21,NaN,NaN,1975.0,NaN,1,1,39,39
22,NaN,NaN,1984.0,NaN,1,1,1,1
23,NaN,NaN,1977.0,NaN,1,1,3,3
24,NaN,NaN,NaN,NaN,1,0,4,0
25,NaN,NaN,NaN,NaN,1,0,2,0
26,NaN,NaN,NaN,NaN,1,0,20,0
27,NaN,NaN,1979.0,NaN,1,1,1,1
28,NaN,NaN,1980.0,NaN,1,1,21,21
29,NaN,NaN,NaN,NaN,1,0,45,0
...,...,...,...,...,...,...,...,...
2200,NaN,NaN,1983.0,NaN,1,1,81,81
2201,NaN,NaN,1971.0,NaN,1,1,44,44
2202,NaN,NaN,1971.0,NaN,1,1,1,1
2203,NaN,NaN,NaN,NaN,1,0,5,0
2204,NaN,NaN,1971.0,NaN,1,1,1,1
2205,NaN,NaN,NaN,NaN,1,0,2,0
2206,NaN,NaN,NaN,NaN,1,0,1,0
2207,NaN,NaN,1968.0,NaN,1,1,14,14
2208,NaN,NaN,NaN,NaN,1,0,1,0
2209,NaN,NaN,1976.0,NaN,1,1,1,1
2210,NaN,NaN,1973.0,NaN,1,1,8,8
2211,NaN,NaN,1980.0,NaN,1,1,34,34
2212,NaN,NaN,1983.0,NaN,1,1,86,86
2213,NaN,NaN,1983.0,NaN,1,1,29,29
2214,NaN,NaN,1975.0,NaN,1,1,2,2
2215,NaN,NaN,NaN,NaN,1,0,16,0
2216,NaN,NaN,NaN,NaN,1,0,10,0
2217,NaN,NaN,1973.0,NaN,1,1,6,6
2218,NaN,NaN,NaN,NaN,1,0,2,0
2219,NaN,NaN,1973.0,NaN,1,1,111,111
2220,NaN,NaN,1983.0,NaN,1,1,121,121
2221,NaN,NaN,NaN,NaN,1,0,1,0
2222,NaN,NaN,NaN,NaN,1,0,14,0
2223,NaN,NaN,1981.0,NaN,1,1,5,5
2224,NaN,NaN,1983.0,NaN,1,1,120,120
2225,NaN,NaN,NaN,NaN,1,0,1,0
2226,NaN,NaN,1981.0,NaN,1,1,32,32
2227,NaN,NaN,1975.0,NaN,1,1,109,109
2228,NaN,NaN,1983.0,NaN,1,1,1,1
2229,NaN,NaN,1973.0,NaN,1,1,2,2

Describe the new float-only DataFrame.

In [ ]:
# Describe Dataframe. All columns are float.
rock.describe().T

,count,mean,std,min,25%,50%,75%,max
release_year,1651.0,1978.569352,9.309780,1955.0,1971.0,1977.0,1984.0,2014.0
first,2230.0,1.000000,0.000000,1.0,1.0,1.0,1.0,1.0
year,2230.0,0.741256,0.438043,0.0,0.0,1.0,1.0,1.0
playcount,2230.0,16.872646,25.302972,0.0,1.0,4.0,21.0,142.0
fg,2230.0,15.048430,25.288366,0.0,0.0,3.0,18.0,142.0



> 
>
>



---



---



> > > > > > > > > Â© 2021 Institute of Data


---



---